{
  "result": [{
      "id": "etark-blog-1",
      "bannerimage": "https://raw.githubusercontent.com/blueedgetechno/loginSystemByBlue/master/blogs/charger.jpg",
      "title": "11 Easy Tips to Improve Your Smartphone’s Battery Life",
      "snippet": "Daily life would be impossible for us nowadays without the use of our mobile phones. We usually have to unlock our phones atleast 60+ times a day. A normal person usually unlocks his phone around 107 times a day. And our daily activities result in high drainage of our phone’s battery. To get the maximum",
      "date": "May 15, 2020",
      "content": "Daily life would be impossible for us nowadays without the use of our mobile phones. We usually have to unlock our phones atleast 60+ times a day. A normal person usually unlocks his phone around 107 times a day.\n\r\n\rAnd our daily activities result in high drainage of our phone’s battery. To get the maximum use of your smartphone’ s battery use the following awesome smartphone hacks:\n\r\n\r\n\r1. Use a black themed wallpaper in order to keep your phone running.\n\r\n\r2. Do not keep your phone on a hot surface or anything which tends to get hot while charging.\n\r\n\r3. Turn off location and auto rotate features.\n\r\n\r4. Don’t discharge your phone completely in order to recharge your phone, this will only shorten the life span of your device.\n\r\n\r5. Clean your cache memory regularly for a bunch of apps.\n\r\n\r6. Don’t charge your phone upto 100%, it runs down quicker than you imagine.\n\r\n\r7. Clean your charging slots regularly, who knows what you might find there.\n\r\n\r8. Turn on airplane mode while charging to charge it quicker.\n\r\n\r9. Do not use fake or duplicate chargers for your phone. They are the biggest enemies of your phone.\n\r\n\r10. Update your phone apps. Up to date apps helps in low battery consumption.\n\r\n\r11. And finally, there is no need to charge your brand new phone for 5hrs. Well it’s a myth and doesn’t do any good to you.\n\r\n\r"
    },
    {
      "id": "etark-blog-2",
      "bannerimage": "https://raw.githubusercontent.com/blueedgetechno/loginSystemByBlue/master/blogs/mirzapur.jpg",
      "title": "Choose your allegiance carefully in this Mirzapur of smartphone servicing",
      "snippet": "Yes, you heard it right. We are talking about justice here. You must be wondering how a smartphone servicing platform like us has anything to do with justice. Well, allow us to enlighten you on this. Smartphone users choose mainly four ways to get their phone fixed :",
      "date": "Oct 15, 2020",
      "content": "Yes, you heard it right. We are talking about justice here. You must be wondering how a smartphone servicing platform like us has anything to do with justice. Well, allow us to enlighten you on this. Smartphone users choose mainly four ways to get their phone fixed :\n\r\n\r1. **Visit any unauthorized service centers** who in the guise of discounted price often provide substandard service or parts for your smartphone. The result is you end up getting your phone fixed multiple times in a year for either the same problem or some new problem that has generated as a result of the previous one, thus making the actual cost of repair way higher than that by an authorized service center.\n\r\n\r2. **Order Home visit repairs for mobile servicing** who often try to sell you false convenience because these technicians aren't authorized by the smartphone companies nor the technicians have the necessary parts available with them in case your phone requires a part replacement. The end result being that technician will further take your phone to some service center thus increasing the time taken to service. Also, these home visit services often ally with unauthorized local centers to provide you discounted prices.\n\r\n\r3. **Mobile Insurance companies or Protection plans** as they are called popularly take advantage of your insecurities as a smartphone user by selling you their insurance plans. When it comes to claiming the insurance policy, often these insurance sellers reject the request on various grounds, thus defeating the very purpose for a smartphone user to buy the plan.\n\r\n\r4. **Visit any authorized service centers** which is actually the right way to go as they are authorized by the smartphone company themselves. In fact some of these smartphone companies themselves are providing pickup and delivery service for customer's convenience. But there's some issue here as well. These deliveries by smartphone companies are hyperlocal in nature which means your phone would be taken only to the nearby authorized center which may take time to get your phone serviced because of issues like parts not available, low manpower availability etc. So even though they are the right agents to do your phone' servicing, but they might not be the best agents.\n\r\n\rSo as you can fathom, justice to your smartphones isn't done in any of these routes. For years these Kaleen Bhaiyas and Munna Bhaiyas of the smartphone industry have been dominating the smartphone users with their ponzi schemes. Now it is time that the Guddu Bhaiya of the smartphone industry will rise to take justice on behalf of the smartphone users. Say no to :\n\r\n\r- Insurance Covers\n\r- Home visit repairs\n\r- Unauthorized service centers\n\r- Waiting in a queue while servicing\n\r- Confusion on warranty consideration of your device\n\r\n\rSay yes to **Authorized Service Centers** only!\n\r\n\rIssued in public interest by [ETark](/login).\n\r"
    },
    {
      "id": "etark-blog-3",
      "bannerimage": "https://raw.githubusercontent.com/blueedgetechno/loginSystemByBlue/master/blogs/ott2.jpg",
      "title": "Enjoy ETark with Netflix India, Hotstar, Amazon Prime Video or Cricbuzz",
      "snippet": "It's the season of OTT shows and sports. So before you sink in to the world of entertainment on Netflix India, Hotstar, Amazon Prime Video or Cricbuzz, you must ensure that your smartphone has a secured servicing partner. Now that you have chosen your allegiance carefully in this Mirzapur",
      "date": "Oct 15, 2020",
      "content": "It's the season of OTT shows and sports. So before you sink in to the world of entertainment on Netflix India, Hotstar, Amazon Prime Video or Cricbuzz, you must ensure that your smartphone has a secured servicing partner. Now that you have chosen your allegiance carefully in this Mirzapur of Smartphone servicing with us, let us explain how ETark helps you with your smartphone servicing.\n\r\n\r\n\r**Pickup and Delivery service** | _For Mobile Repairing / Mobile Servicing / Parts Replacement_\n\r\n\rIt's not just a pickup and delivery service. It's the entire servicing experience brought together in a single platform. Through our process innovations, we help service centers get your phone fixed in the shortest time and safely delivered back to you without compromising on quality.\n\r\n\r<p align='center'>\n\r<img src='https://cdn4.iconfinder.com/data/icons/contact-us-19/48/91-512.png' width='24'>\n\r&nbsp; <a>Our video coming soon</a>\n\r</p>\n\r\n\r**Neo Plan** | _For filing your smartphone complaint in a consumer forum/ court_\n\r\n\rIn the event you wish to take your complaint in a consumer forum/ court which is a free online service by the Indian govt. and doesn't demand you to appear before any court or go through any legal matter, however in order for you to get some resolution or some compensation from the process, you may have to wait for a long duration of about 2 months or beyond, it is important for you to know beforehand where your case stands and how likely you are to win.\n\r\n\rThis is precisely where we come in. Through ETark's revolutionary automated complaint analysis tool under this plan, you would be able to instantly get an estimated value of :\n\r\n\r1. Your chances of winning had your complaint been filed in a consumer forum/ court\n\r\n\r2. Your expected compensation had the case been won in a consumer forum/ court\n\r"
    },
    {
      "id": "etark-blog-4",
      "bannerimage": "https://raw.githubusercontent.com/blueedgetechno/loginSystemByBlue/master/blogs/neoplan.jpg",
      "title": "Unleash true power of Consumer Forum with ETark",
      "snippet": "Did you know that you as a mobile user can get your phone complaint resolved by filing your complaint in a consumer forum / court in India. It's a free service by the Govt. of India to protect the rights of the consumers of India. It could help resolve your grievance against the smartphone seller ",
      "date": "Oct 17, 2020",
      "content": "**Neo Plan | Our invention** : An advanced Smartphone Complaint Analysis tool\n\r\n\rDid you know that you as a mobile user can get your phone complaint resolved by filing your complaint in a consumer forum / court in India. It's a free service by the Govt. of India to protect the rights of the consumers of India. It could help resolve your grievance against the smartphone seller (Ecommerce or Offline retailer) or the smartphone manufacturer with a suitable compensation granted in the end.\n\r\n\rDon't be afraid, these aren't the usual civil courts, in fact your complaint can be filed online at your own convenience and you don't need to physically visit anywhere or face any disruption in your daily life or work due to this.\n\r\n\rOnce you register your complaint there which could also be done even over call via a consumer helpline provided on the portal  apart from online or physical ways of doing so, they would be updating you on the status of your case from time to time. Check out this link to [learn more](https://consumerhelpline.gov.in)\n\r\n\rHowever there's a caveat to the same, statistically speaking it might take a minimum of about 2 months or even beyond to get some resolution from the Consumer forum. So a very important question is : Is it worth waiting that long? The answer to that question depends on how your case might turn out to be and what would you get out of the process. This is where we step in. We aren't magicians who can predict the future but as far as predictions is concerned, it's our forte and we do so using advanced AI tools.\n\r\n\rThrough our Neo Plan, we'll let you know:\n\r\n\r- Your chances of winning had your complaint been filed in a consumer forum / court\n\r\n\r- Your Expected Compensation had the complaint been won in a consumer forum / court\n\r\n\rAll this instantly so that before you decide to file your complaint in a consumer forum / court, you get some idea of what result you are likely to get.\n\r"
    }
  ]
}
